tap "codeclimate/formulae"
tap "fishtown-analytics/dbt"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "shinokada/consize"

brew "act"
brew "webp"
brew "bash"
brew "cloc"
brew "docker"
brew "docker-buildx"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git"
brew "graphviz"
brew "hugo"
brew "hyperkit"
brew "imagemagick"
brew "jq"
brew "minikube"
brew "mysql"
brew "mysql-client"
brew "nghttp2"
brew "nmap"
brew "optipng"
brew "pandoc"
brew "pgloader"
brew "pipx"
brew "postgresql@14"
brew "python@3.8"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "pre-commit"
brew "pyenv"
brew "rust"
brew "skaffold"
brew "youtube-dl"
brew "zsh"
cask "inkscape"
cask "osxfuse"

vscode "aaron-bond.better-comments"
vscode "adamhartford.vscode-base64"
vscode "adpyke.vscode-sql-formatter"
vscode "blanu.vscode-styled-jsx"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "charliermarsh.ruff"
vscode "ckolkman.vscode-postgres"
vscode "csstools.postcss"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "GrapeCity.gc-excelviewer"
vscode "jithurjacob.nbpreviewer"
vscode "Kelvin.vscode-sshfs"
vscode "lextudio.restructuredtext"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "michelemelluso.code-beautifier"
vscode "mikestead.dotenv"
vscode "mkloubert.vscode-remote-workspace"
vscode "moalamri.inline-fold"
vscode "mohd-akram.vscode-html-format"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-fr"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nickfode.latex-formatter"
vscode "NicolasVuillamy.vscode-groovy-lint"
vscode "octref.tachyons"
vscode "PKief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "rafaelmaiolla.remote-vscode"
vscode "redhat.fabric8-analytics"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "stivo.tailwind-fold"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wholroyd.jinja"
